export const careers = [
  {
    title: '플랫폼 V1에서 V2로 새 플랫폼 개발, 마이그레이션 및 업그레이드',
    subtitle: '플랫폼 전체 기존 시스템과 디자인을 업그레이드 시키며 새로운 플랫폼을 만들었어요.',
    details: [
      <p key={1}>
        백앤드 3명, 프론트앤드 4명으로 구성된 엔지니어 팀 내에 속해 빠르게 진행되는 속도의 개발과
        QA를 통해 6개월 안에 새로운 V2 플랫폼 개발 후 배포한 경험
      </p>,
      <p key={2}>
        회사 초기 멤버로 기존 시스템과 코드 문제에 대한 지식을 바탕으로 개선 방향을 제안한 경험
      </p>,
      <p key={3}>
        아토믹 디자인 패턴을 활용하여 컴포넌트 단위 개발 경험과 페이지 단위 마이그레이션 개발 경험
      </p>,
      <p key={4}>
        Nextjs, TypeScript와 Storybook 도입에 대해 적극적으로 어필해 코드에 대한 안정성을 높이고
        컴포넌트 UI 개발 환경을 활용해 코드 리뷰 및 QA에 참여
      </p>,
      <p key={5}>
        스타트업과 기술 전문가 전체 세션 수 207개 → 435개 (2023 9월 기준)로 2배 이상 향상
      </p>
    ]
  },
  {
    title: '플랫폼 전체 모바일 웹 개선',
    subtitle: '모바일 사용자들을 위해 플랫폼 모든 페이지들을 모바일 친화적으로 만들었어요. ',
    details: [
      <p key={1}>
        웹 디자이너와 모바일 디자인에 대한 직접적인 피드백을 주고받는데 적극적으로 참여하여 모바일
        디자인 개선
      </p>,
      <p key={2}>
        모바일 웹 개선으로 인해 모바일 이탈률 40% → 20%로 감소, 즉 모바일 이탈률이 50% 감소{' '}
      </p>
    ]
  },
  {
    title: '기술 전문가 onboarding 서비스',
    subtitle: '기술 전문가들에 대한 정보를 수집하는 onboarding 서비스를 개발하고 개선했어요.',
    details: [
      <p key={1}>
        react-hook-form을 이용한 수집된 정보 관리 및 브라우저 뒤로 가기와 새로고침에 대한 정보
        유지로 유저 경험 향상
      </p>,
      <p key={2}>다양한 라이브러리를 통해 자연스러운 UI/UX 개발 </p>,
      <p key={3}>
        V1에서 겪었던 복잡한 코드로 인한 개발 및 분석 문제 개선을 위해 깔끔한 onboarding 단계
        컴포넌트 분리, 중복로직 helper 함수 관리등으로 코드 품질 개선{' '}
      </p>,
      <p key={4}>기술 전문가 onboarding 전환율 2배 향상</p>
    ]
  },
  {
    title: '세션 세부정보 및 트랜스크립트 페이지 개발 ',
    subtitle:
      '스타트업과 기술 전문가의 세션 후 자세한 정보를 보여주고 녹화된 영상, 설문조사 결과,  트랜스크립트를 보여주는 페이지를 개발',
    details: [
      <p key={1}>
        Sass에 대한 이해도를 통해 작업 효율을 높이고 페이지 스크롤에 대한 비디오 애니메이션 및 영상
        속도와 싱크 되는 트랜스크립트를 추가해 개발
      </p>,
      <p key={2}>데이터를 가져오는 초기 로딩 시간에 스켈레톤 컴포넌트 추가를 통해 사용자 UX 향상</p>
    ]
  }
];
